ravynsoft/ravynos/Kernel/Extensions/IOUSBFamily/include/IOKit/usb/IOUSBDevice.h
    virtual const IOUSBDescriptorHeader* FindNextDescriptor(const void *cur, UInt8 descType);

    virtual void 	DisplayNotEnoughPowerNotice();
    
    // These are non-virtual function so that we don't have to take up a binary compatibility slot.
    UInt16	GetbcdUSB(void);
    UInt8   GetDeviceClass(void);
    UInt8   GetDeviceSubClass(void);
    UInt8	GetProtocol(void);
    UInt32  GetLocationID(void);
	void	SetBusPowerAvailable(UInt32 newPower);

    OSMetaClassDeclareReservedUsed(IOUSBDevice,  0);
    /*!
	@function DeviceRequest
        @abstract execute a control request to the default control pipe (pipe zero)
        @param request The parameter block to send to the device
        @param noDataTimeout Specifies an amount of time (in ms) after which the command will be aborted
        if no data has been transferred on the bus.
        @param completionTimeout Specifies an amount of time (in ms) after which the command will be aborted if the entire command has
        not been completed.
		@param completion Function to call when request completes. If omitted then
	 DeviceRequest() executes synchronously, blocking until the request is complete.  If the request is asynchronous, the client must make sure that
	 the IOUSBDevRequest is not released until the callback has occurred.

    */
    virtual IOReturn DeviceRequest(IOUSBDevRequest	*request,
				UInt32 noDataTimeout,
				UInt32 completionTimeout,
                                IOUSBCompletion	*completion = 0);

    /*!
	 @function DeviceRequest
	 @abstract execute a control request to the default control pipe (pipe zero)
	 @param request The parameter block to send to the device (with the pData as an IOMemoryDesriptor)
	 @param noDataTimeout Specifies an amount of time (in ms) after which the command will be aborted
	 if no data has been transferred on the bus.
	 @param completionTimeout Specifies an amount of time (in ms) after which the command will be aborted if the entire command has
	 not been completed.
	 @param completion Function to call when request completes. If omitted then
	 DeviceRequest() executes synchronously, blocking until the request is complete.  If the request is asynchronous, the client must make sure that
	 the IOUSBDevRequest is not released until the callback has occurred.
	 
	 */
    OSMetaClassDeclareReservedUsed(IOUSBDevice,  1);
    virtual IOReturn DeviceRequest(IOUSBDevRequestDesc	*request,
				    UInt32 noDataTimeout,
				    UInt32 completionTimeout,
				    IOUSBCompletion	*completion = 0);

    OSMetaClassDeclareReservedUsed(IOUSBDevice,  2);
    /*!
	@function SuspendDevice
        @abstract Instruct the hub to which this device is attached to suspend or resume the port to which the device is attached.
        Note that if there are any outstanding transactions on any pipes in the device, those transactions will get returned with a 
        kIOReturnNotResponding error.
        @param suspend Boolean value. true = suspend, false = resume.
    */
    virtual IOReturn SuspendDevice( bool suspend);
    
    OSMetaClassDeclareReservedUsed(IOUSBDevice,  3);
    /*!
	@function ReEnumerateDevice
        @abstract Instruct the hub to which this device is attached to reset the port to which this device is attached. This causes the
        IOUSBDevice object and any child objects (IOUSBInterface objects or driver objects) to be terminated, and the device to be
        completely reenumerated, as if it had been detached and reattached.
        @param options Reserved for future use.
    */
    virtual IOReturn ReEnumerateDevice( UInt32 options );
    
    OSMetaClassDeclareReservedUsed(IOUSBDevice,  4);
    /*!
        @function DisplayUserNotification
        @abstract  Will use the Notification Center to display a notification to the user.  Only Low Power and Overcurrent notifications are supported.
        @param notificationType Which notification to display.
     */
    virtual void	DisplayUserNotification(UInt32 notificationType);
    
    OSMetaClassDeclareReservedUsed(IOUSBDevice,  5);
	// Deprecated but needed for binary compatibility
    virtual IOUSBPipe*	MakePipe(const IOUSBEndpointDescriptor *ep, IOUSBInterface *interface);
    
	
    OSMetaClassDeclareReservedUsed(IOUSBDevice,  6);
	/*!
	 @function SetHubParent
	 @abstract Used by the hub driver to give the nub a pointer to its HubPolicyMaker object
	 @param hubPolicyMaker	The object representing the Hub driver
	 */
    virtual void	SetHubParent(IOUSBHubPolicyMaker *hubParent);
    
    OSMetaClassDeclareReservedUsed(IOUSBDevice,  7);
	/*!
	 @function GetHubParent
	 @abstract Used by the hub driver to give the nub a pointer to its HubPolicyMaker object
	 @param hubPolicyMaker	The object representing the Hub driver
	 */
    virtual IOUSBHubPolicyMaker*	GetHubParent();
    
    OSMetaClassDeclareReservedUsed(IOUSBDevice,  8);
    /*!
	 @function 	GetDeviceInformation
	 @abstract 	Returns status information about the USB device, such as whether the device is captive or whether it is in the suspended state.
	 @param requestedPower 	The desired amount of power that the client wishes to reserve
	 @result 		Actual power that was reserved
	 
		*/
	virtual IOReturn	GetDeviceInformation(UInt32 *info);
    
    OSMetaClassDeclareReservedUsed(IOUSBDevice,  9);
    /*!
	 @function				RequestExtraPower
	 @abstract				Clients can use this API to reserve extra power for use by this device while the machine is asleep or while it is awake.  Units are milliAmps (mA).
	 @param type			Indicates whether the power is to be used during wake or sleep (One of kUSBPowerDuringSleep or kUSBPowerDuringWake)
	 @param requestedPower 	Amount of power desired, in mA
	 @result				Amount of power actually reserved, in mA.  It can be less than the requested or zero.
	 
	 */
	virtual UInt32	RequestExtraPower(UInt32 type, UInt32 requestedPower);
    
    OSMetaClassDeclareReservedUsed(IOUSBDevice,  10);
    /*!
	 @function				ReturnExtraPower
	 @abstract				Clients can use this API to tell the system that they will not use power that was previously reserved by using the RequestExtraPower API.
	 @param type			Indicates whether the power is to be used during wake or sleep (One of kUSBPowerDuringSleep or kUSBPowerDuringWake)
	 @param returnedPower 	Amount of power that is no longer needed, in mA
	 @result				If the returnedPower was not previously allocated, an error will be returned.  This will include the case for power that was requested for sleep but was returned for wake.
	 
	 */
	virtual IOReturn		ReturnExtraPower(UInt32 type, UInt32 returnedPower);
    
    OSMetaClassDeclareReservedUsed(IOUSBDevice,  11);
    /*!
	 @function				GetExtraPowerAllocated
	 @abstract				Clients can use this API to ask how much extra power has already been reserved by this device.  Units are milliAmps (mA).
	 @param type			Indicates whether the allocated power was to be used during wake or sleep (One of kUSBPowerDuringSleep or kUSBPowerDuringWake)
	 @result				Amount of power allocated, in mA.
	 
	 */
	virtual UInt32			GetExtraPowerAllocated(UInt32 type);
    
    OSMetaClassDeclareReservedUsed(IOUSBDevice,  12);
    /*!
	 @function				DoLocationOverrideAndModelMatch
	 @abstract				Will look for a kOverrideIfAtLocationID array proerty with locationID entries and a "MacModel" property.  If any of the locationIDs match to the Mac Model, will return true.
	 						If there is no kOverrideAtLocationID property, it will also return true.
	 @result				True if we have a match, false otherwise
	 */
	virtual	bool			DoLocationOverrideAndModelMatch();
	
