ravynsoft/ravynos/Kernel/Extensions/IOUSBFamily/include/IOKit/usb/IOUSBDevice.h
    OSMetaClassDeclareReservedUsed(IOUSBDevice,  13);
    /*!
	 @function SetConfiguration
	 Do a USB SetConfiguration call to the device. The caller must have the device open() in order to 
	 actually cause a configuration change. If the device is currently configured, all IOUSBInterface objects
	 associated with the device are freed. After the new configuration has been set, all of its IOUSBInterface objects are
	 instantiated automatically.
	 @param forClient The client requesting the configuration change
	 @param configValue The desired configuration value.
	 @param startInterfaceMatching A boolean specifying whether IOKit should begin the process of finding
	 @param issueRemoteWakeup A boolean specifying whether we should issue the SetFeature(kUSBFeatureDeviceRemoteWakeup) immediately after setting the configuration, before loading any drivers.
	 matching drivers for the new IOUSBInterface objects.
	 */
    virtual IOReturn SetConfiguration(IOService *forClient, UInt8 configValue, bool startInterfaceMatching, bool issueRemoteWakeup);
    
    OSMetaClassDeclareReservedUsed(IOUSBDevice,  14);
    /*!
	 @function		OpenOrCloseAllInterfacePipes		
	 @abstract		Iterates over all interfaces and either opens all the pipes, or closes them all		
	 @param			open, if true pipes are opened, else closed
	 */
	virtual void OpenOrCloseAllInterfacePipes(bool open);
	
	
	
	
    OSMetaClassDeclareReservedUsed(IOUSBDevice,  15);
	/*!
	 @function MakePipe
	 @abstract build a pipe on a given endpoint
	 @param ep A description of the endpoint
	 @param sscd The SuperSpeed Companion Descriptor, if any (NULL if none)
	 @param interface The IOUSBInterface object requesting the pipe
	 returns the desired IOUSBPipe object
	 */
    virtual IOUSBPipeV2*	MakePipe(const IOUSBEndpointDescriptor *ep, IOUSBSuperSpeedEndpointCompanionDescriptor *sscd, IOUSBInterface *interface);

    OSMetaClassDeclareReservedUsed(IOUSBDevice,  16);
    /*!
	 @function SetAddress
	 @param 	Sets the bus address of the device
	 */
    virtual void 			SetAddress(USBDeviceAddress address);
    

    OSMetaClassDeclareReservedUnused(IOUSBDevice,  17);
    OSMetaClassDeclareReservedUnused(IOUSBDevice,  18);
    OSMetaClassDeclareReservedUnused(IOUSBDevice,  19);

private:

    static void			ProcessPortResetEntry(__unused OSObject *target){};			// obsolete
    void				ProcessPortReset(void){};									// obsolete

    void				TerminateInterfaces(bool terminate);

    static void			ProcessPortReEnumerateEntry(OSObject *target, thread_call_param_t options);
    void				ProcessPortReEnumerate(UInt32 options);
	
    static void			DoMessageClientsEntry(OSObject *target, thread_call_param_t messageStruct);
    void				DoMessageClients( void * messageStructPtr);
	
    static void			DisplayUserNotificationForDeviceEntry (OSObject *owner, IOTimerEventSource *sender);
    void				DisplayUserNotificationForDevice( );
    
    UInt32              SimpleUnicodeToUTF8(UInt16 uChar, UInt8 utf8Bytes[4]);
    void                SwapUniWords (UInt16  **unicodeString, UInt32 uniSize);

    IOReturn			TakeGetConfigLock(void);
    IOReturn			ReleaseGetConfigLock(void);
    static IOReturn		ChangeGetConfigLock(OSObject *target, void *arg0, void *arg1, void *arg2, void *arg3);
	
	void				RegisterInterfaces(void);
	
    static IOReturn		_ResetDevice(OSObject *target, void *arg0, void *arg1, void *arg2, void *arg3);
    static IOReturn		_ReEnumerateDevice(OSObject *target, void *arg0, void *arg1, void *arg2, void *arg3);
	static IOReturn		_DeviceRequest(OSObject *target, void *arg0, void *arg1, __unused void *arg2, __unused void *arg3);
	static IOReturn		_DeviceRequestDesc(OSObject *target, void *arg0, void *arg1, __unused void *arg2, __unused void *arg3);
	static IOReturn		_GetConfiguration(OSObject *target, void *arg0,  __unused void *arg1, __unused void *arg2, __unused void *arg3);
	static IOReturn		_GetDeviceStatus(OSObject *target, void *arg0,  __unused void *arg1, __unused void *arg2, __unused void *arg3);
	static IOReturn		_DeviceRequestWithTimeout(OSObject *target, void *arg0, void *arg1, void *arg2, void *arg3);
	static IOReturn		_DeviceRequestDescWithTimeout(OSObject *target, void *arg0, void *arg1, void *arg2, void *arg3);

};

#endif
